nxp-appcodehub/dm-lvgl-epaper-smartlabel-kw45/k32w148evk_wireless_uart_epaper_freertos/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_UnInitPinLED4
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_UnInitPinLED4(void)
{
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortA);

    /* PORTA20 (pin 17) is configured as ADC0_A14 */
    PORT_SetPinMux(BOARD_UNINITPINLED4_LED_B_PORT, BOARD_UNINITPINLED4_LED_B_PIN, kPORT_PinDisabledOrAnalog);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitEPaperPins:
- options: {createDeInit: 'true', callFromInitBoot: 'false', coreID: cm33, enableClock: 'true', customDeInitName: BOARD_UnInitEPaperPins}
- pin_list:
  - {pin_num: '48', peripheral: LPSPI1, signal: SCK, pin_signal: ADC0_B12/PTB2/LPSPI1_SCK/LPUART1_TX/TPM1_CH2/FLEXIO0_D28, pull_select: down, pull_enable: disable,
    slew_rate: fast, open_drain: disable, drive_strength: high}
  - {pin_num: '47', peripheral: LPSPI1, signal: IN, pin_signal: ADC0_B11/PTB1/LPSPI1_SIN/TPM1_CH1/FLEXIO0_D27, direction: INPUT, pull_select: down, pull_enable: disable,
    slew_rate: fast, open_drain: disable, drive_strength: high}
  - {pin_num: '1', peripheral: LPSPI1, signal: OUT, pin_signal: ADC0_B13/PTB3/WUU0_P14/LPSPI1_SOUT/LPUART1_RX/TPM1_CH3/FLEXIO0_D29, pull_select: down, pull_enable: disable,
    slew_rate: fast, open_drain: disable, drive_strength: high}
  - {pin_num: '2', peripheral: LPSPI1, signal: PCS3, pin_signal: PTB4/WUU0_P15/LPSPI1_PCS3/LPUART1_CTS_b/LPI2C1_SDA/I3C0_SDA/TRGMUX0_IN0/FLEXIO0_D30, identifier: EPAPER_CS,
    direction: OUTPUT, pull_select: up, pull_enable: disable, slew_rate: fast, open_drain: disable, drive_strength: high}
  - {pin_num: '13', peripheral: GPIOA, signal: 'GPIO, 18', pin_signal: CMP1_IN1/PTA18/LPSPI0_SOUT/LPUART0_CTS_b/LPI2C0_SDA/TPM0_CH3/RF_GPO_0/LPUART0_RX, direction: OUTPUT,
    gpio_init_state: no_init, pull_select: down, pull_enable: disable, pull_value: low, slew_rate: fast, passive_filter: disable, open_drain: disable, drive_strength: low,
    drive_strength_1: normal}
  - {pin_num: '3', peripheral: GPIOB, signal: 'GPIO, 5', pin_signal: PTB5/LPSPI1_PCS2/LPUART1_RTS_b/LPI2C1_SCL/I3C0_SCL/TRGMUX0_OUT0/FLEXIO0_D31, identifier: EPAPER_RST,
    direction: OUTPUT, gpio_init_state: 'true', pull_select: up, pull_enable: enable}
  - {pin_num: '18', peripheral: GPIOA, signal: 'GPIO, 21', pin_signal: ADC0_A15/CMP0_IN2/PTA21/WUU0_P5/LPSPI0_PCS3/LPUART0_RX/EWM0_OUT_b/TPM0_CH0/RF_GPO_3/RF_GPO_7/FLEXIO0_D8/RF_GPO_10,
    identifier: EPAPER_BUSY, direction: INPUT, gpio_per_interrupt_sel: no_init, gpio_per_interrupt: no_init}
  - {pin_num: '46', peripheral: LPSPI1, signal: PCS0, pin_signal: ADC0_B10/PTB0/WUU0_P13/LPSPI1_PCS0/TPM1_CH0/FLEXIO0_D26, identifier: SPIRAM_CS, direction: OUTPUT,
    pull_select: up, drive_strength: high}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitEPaperPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitEPaperPins(void)
{
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_GpioA);
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_GpioB);
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortB);

    gpio_pin_config_t EPAPER_DC_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA18 (pin 13)  */
    GPIO_PinInit(BOARD_INITEPAPERPINS_EPAPER_DC_GPIO, BOARD_INITEPAPERPINS_EPAPER_DC_PIN, &EPAPER_DC_config);

    gpio_pin_config_t EPAPER_BUSY_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA21 (pin 18)  */
    GPIO_PinInit(BOARD_INITEPAPERPINS_EPAPER_BUSY_GPIO, BOARD_INITEPAPERPINS_EPAPER_BUSY_PIN, &EPAPER_BUSY_config);

    gpio_pin_config_t EPAPER_RST_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTB5 (pin 3)  */
    GPIO_PinInit(BOARD_INITEPAPERPINS_EPAPER_RST_GPIO, BOARD_INITEPAPERPINS_EPAPER_RST_PIN, &EPAPER_RST_config);

    const port_pin_config_t EPAPER_DC = {/* Internal pull-up/down resistor is disabled */
                                         (uint16_t)kPORT_PullDisable,
                                         /* Low internal pull resistor value is selected. */
                                         (uint16_t)kPORT_LowPullResistor,
                                         /* Fast slew rate is configured */
                                         (uint16_t)kPORT_FastSlewRate,
                                         /* Passive input filter is disabled */
                                         (uint16_t)kPORT_PassiveFilterDisable,
                                         /* Open drain output is disabled */
                                         (uint16_t)kPORT_OpenDrainDisable,
                                         /* Low drive strength is configured */
                                         (uint16_t)kPORT_LowDriveStrength,
                                         /* Normal drive strength is configured */
                                         (uint16_t)kPORT_NormalDriveStrength,
                                         /* Pin is configured as PTA18 */
                                         (uint16_t)kPORT_MuxAsGpio,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         (uint16_t)kPORT_UnlockRegister};
    /* PORTA18 (pin 13) is configured as PTA18 */
    PORT_SetPinConfig(BOARD_INITEPAPERPINS_EPAPER_DC_PORT, BOARD_INITEPAPERPINS_EPAPER_DC_PIN, &EPAPER_DC);

    /* PORTA21 (pin 18) is configured as PTA21 */
    PORT_SetPinMux(BOARD_INITEPAPERPINS_EPAPER_BUSY_PORT, BOARD_INITEPAPERPINS_EPAPER_BUSY_PIN, kPORT_MuxAsGpio);

    /* PORTB0 (pin 46) is configured as LPSPI1_PCS0 */
    PORT_SetPinMux(BOARD_INITEPAPERPINS_SPIRAM_CS_PORT, BOARD_INITEPAPERPINS_SPIRAM_CS_PIN, kPORT_MuxAlt2);

    PORTB->PCR[0] = ((PORTB->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_DSE_MASK)))

