nxp-appcodehub/dm-lvgl-epaper-smartlabel-kw45/k32w148evk_wireless_uart_epaper_freertos/board/pin_mux.c
                     /* Pull Select: Enables internal pullup resistor. */
                     | PORT_PCR_PS(PCR_PS_ps1)

                     /* Drive Strength Enable: High. */
                     | PORT_PCR_DSE(PCR_DSE_dse1));

    const port_pin_config_t SI_IO1 = {/* Internal pull-up/down resistor is disabled */
                                      (uint16_t)kPORT_PullDisable,
                                      /* Low internal pull resistor value is selected. */
                                      (uint16_t)kPORT_LowPullResistor,
                                      /* Fast slew rate is configured */
                                      (uint16_t)kPORT_FastSlewRate,
                                      /* Passive input filter is disabled */
                                      (uint16_t)kPORT_PassiveFilterDisable,
                                      /* Open drain output is disabled */
                                      (uint16_t)kPORT_OpenDrainDisable,
                                      /* High drive strength is configured */
                                      (uint16_t)kPORT_HighDriveStrength,
                                      /* Normal drive strength is configured */
                                      (uint16_t)kPORT_NormalDriveStrength,
                                      /* Pin is configured as LPSPI1_SIN */
                                      (uint16_t)kPORT_MuxAlt2,
                                      /* Pin Control Register fields [15:0] are not locked */
                                      (uint16_t)kPORT_UnlockRegister};
    /* PORTB1 (pin 47) is configured as LPSPI1_SIN */
    PORT_SetPinConfig(BOARD_INITEPAPERPINS_SI_IO1_PORT, BOARD_INITEPAPERPINS_SI_IO1_PIN, &SI_IO1);

    const port_pin_config_t SCKSI_IO1 = {/* Internal pull-up/down resistor is disabled */
                                         (uint16_t)kPORT_PullDisable,
                                         /* Low internal pull resistor value is selected. */
                                         (uint16_t)kPORT_LowPullResistor,
                                         /* Fast slew rate is configured */
                                         (uint16_t)kPORT_FastSlewRate,
                                         /* Passive input filter is disabled */
                                         (uint16_t)kPORT_PassiveFilterDisable,
                                         /* Open drain output is disabled */
                                         (uint16_t)kPORT_OpenDrainDisable,
                                         /* High drive strength is configured */
                                         (uint16_t)kPORT_HighDriveStrength,
                                         /* Normal drive strength is configured */
                                         (uint16_t)kPORT_NormalDriveStrength,
                                         /* Pin is configured as LPSPI1_SCK */
                                         (uint16_t)kPORT_MuxAlt2,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         (uint16_t)kPORT_UnlockRegister};
    /* PORTB2 (pin 48) is configured as LPSPI1_SCK */
    PORT_SetPinConfig(BOARD_INITEPAPERPINS_SCKSI_IO1_PORT, BOARD_INITEPAPERPINS_SCKSI_IO1_PIN, &SCKSI_IO1);

    const port_pin_config_t SO_IO1 = {/* Internal pull-up/down resistor is disabled */
                                      (uint16_t)kPORT_PullDisable,
                                      /* Low internal pull resistor value is selected. */
                                      (uint16_t)kPORT_LowPullResistor,
                                      /* Fast slew rate is configured */
                                      (uint16_t)kPORT_FastSlewRate,
                                      /* Passive input filter is disabled */
                                      (uint16_t)kPORT_PassiveFilterDisable,
                                      /* Open drain output is disabled */
                                      (uint16_t)kPORT_OpenDrainDisable,
                                      /* High drive strength is configured */
                                      (uint16_t)kPORT_HighDriveStrength,
                                      /* Normal drive strength is configured */
                                      (uint16_t)kPORT_NormalDriveStrength,
                                      /* Pin is configured as LPSPI1_SOUT */
                                      (uint16_t)kPORT_MuxAlt2,
                                      /* Pin Control Register fields [15:0] are not locked */
                                      (uint16_t)kPORT_UnlockRegister};
    /* PORTB3 (pin 1) is configured as LPSPI1_SOUT */
    PORT_SetPinConfig(BOARD_INITEPAPERPINS_SO_IO1_PORT, BOARD_INITEPAPERPINS_SO_IO1_PIN, &SO_IO1);

    /* PORTB4 (pin 2) is configured as LPSPI1_PCS3 */
    PORT_SetPinMux(BOARD_INITEPAPERPINS_EPAPER_CS_PORT, BOARD_INITEPAPERPINS_EPAPER_CS_PIN, kPORT_MuxAlt2);

    PORTB->PCR[4] =
        ((PORTB->PCR[4] &
          /* Mask bits to zero which are setting */
          (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK)))

         /* Pull Select: Enables internal pullup resistor. */
         | PORT_PCR_PS(PCR_PS_ps1)

         /* Pull Enable: Disables. */
         | PORT_PCR_PE(PCR_PE_pe0)

         /* Slew Rate Enable: Fast. */
         | PORT_PCR_SRE(PCR_SRE_sre0)

         /* Open Drain Enable: Disables. */
         | PORT_PCR_ODE(PCR_ODE_ode0)

         /* Drive Strength Enable: High. */
         | PORT_PCR_DSE(PCR_DSE_dse1));

    /* PORTB5 (pin 3) is configured as PTB5 */
    PORT_SetPinMux(BOARD_INITEPAPERPINS_EPAPER_RST_PORT, BOARD_INITEPAPERPINS_EPAPER_RST_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[5] = ((PORTB->PCR[5] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK)))

                     /* Pull Select: Enables internal pullup resistor. */
                     | PORT_PCR_PS(PCR_PS_ps1)

                     /* Pull Enable: Enables. */
                     | PORT_PCR_PE(PCR_PE_pe1));
}


