nxp-appcodehub/dm-lvgl-epaper-smartlabel-kw45/k32w148evk_wireless_uart_epaper_freertos/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_UnInitEPaperPins
 * Description   : This is a de-initialization function for 'BOARD_InitEPaperPins' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 * END ****************************************************************************************************************/
void BOARD_UnInitEPaperPins(void)
{
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortB);

    /* EFT detect interrupts configuration on PORTA */
    PORT_DisableEFTDetectInterrupts(PORTA, 0x240000u);

    const port_pin_config_t porta18_pin13_config = {/* Internal pull-up/down resistor is disabled */
                                                    (uint16_t)kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    (uint16_t)kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    (uint16_t)kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    (uint16_t)kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    (uint16_t)kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    (uint16_t)kPORT_LowDriveStrength,
                                                    /* Normal drive strength is configured */
                                                    (uint16_t)kPORT_NormalDriveStrength,
                                                    /* Pin is configured as CMP1_IN1 */
                                                    (uint16_t)kPORT_PinDisabledOrAnalog,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    (uint16_t)kPORT_UnlockRegister};
    /* PORTA18 (pin 13) is configured as CMP1_IN1 */
    PORT_SetPinConfig(PORTA, 18U, &porta18_pin13_config);

    const port_pin_config_t porta21_pin18_config = {/* Internal pull-up/down resistor is disabled */
                                                    (uint16_t)kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    (uint16_t)kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    (uint16_t)kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    (uint16_t)kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    (uint16_t)kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    (uint16_t)kPORT_LowDriveStrength,
                                                    /* Normal drive strength is configured */
                                                    (uint16_t)kPORT_NormalDriveStrength,
                                                    /* Pin is configured as ADC0_A15 */
                                                    (uint16_t)kPORT_PinDisabledOrAnalog,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    (uint16_t)kPORT_UnlockRegister};
    /* PORTA21 (pin 18) is configured as ADC0_A15 */
    PORT_SetPinConfig(PORTA, 21U, &porta21_pin18_config);

    /* EFT detect interrupts configuration on PORTB */
    PORT_DisableEFTDetectInterrupts(PORTB, 0x3Fu);

    const port_pin_config_t portb0_pin46_config = {/* Internal pull-up/down resistor is disabled */
                                                   (uint16_t)kPORT_PullDisable,
                                                   /* Low internal pull resistor value is selected. */
                                                   (uint16_t)kPORT_LowPullResistor,
                                                   /* Fast slew rate is configured */
                                                   (uint16_t)kPORT_FastSlewRate,
                                                   /* Passive input filter is disabled */
                                                   (uint16_t)kPORT_PassiveFilterDisable,
                                                   /* Open drain output is disabled */
                                                   (uint16_t)kPORT_OpenDrainDisable,
                                                   /* Low drive strength is configured */
                                                   (uint16_t)kPORT_LowDriveStrength,
                                                   /* Normal drive strength is configured */
                                                   (uint16_t)kPORT_NormalDriveStrength,
                                                   /* Pin is configured as ADC0_B10 */
                                                   (uint16_t)kPORT_PinDisabledOrAnalog,
                                                   /* Pin Control Register fields [15:0] are not locked */
                                                   (uint16_t)kPORT_UnlockRegister};
    /* PORTB0 (pin 46) is configured as ADC0_B10 */
    PORT_SetPinConfig(PORTB, 0U, &portb0_pin46_config);

    const port_pin_config_t SI_IO1 = {/* Internal pull-up/down resistor is disabled */
                                      (uint16_t)kPORT_PullDisable,
                                      /* Low internal pull resistor value is selected. */
                                      (uint16_t)kPORT_LowPullResistor,
                                      /* Fast slew rate is configured */
                                      (uint16_t)kPORT_FastSlewRate,
                                      /* Passive input filter is disabled */
                                      (uint16_t)kPORT_PassiveFilterDisable,
                                      /* Open drain output is disabled */
                                      (uint16_t)kPORT_OpenDrainDisable,
                                      /* Low drive strength is configured */
                                      (uint16_t)kPORT_LowDriveStrength,
                                      /* Normal drive strength is configured */
                                      (uint16_t)kPORT_NormalDriveStrength,
                                      /* Pin is configured as ADC0_B11 */
                                      (uint16_t)kPORT_PinDisabledOrAnalog,
                                      /* Pin Control Register fields [15:0] are not locked */
                                      (uint16_t)kPORT_UnlockRegister};
    /* PORTB1 (pin 47) is configured as ADC0_B11 */
    PORT_SetPinConfig(BOARD_UNINITEPAPERPINS_SI_IO1_PORT, BOARD_UNINITEPAPERPINS_SI_IO1_PIN, &SI_IO1);

    const port_pin_config_t SCKSI_IO1 = {/* Internal pull-up/down resistor is disabled */
                                         (uint16_t)kPORT_PullDisable,
                                         /* Low internal pull resistor value is selected. */
                                         (uint16_t)kPORT_LowPullResistor,
                                         /* Fast slew rate is configured */
                                         (uint16_t)kPORT_FastSlewRate,
                                         /* Passive input filter is disabled */
                                         (uint16_t)kPORT_PassiveFilterDisable,
                                         /* Open drain output is disabled */
                                         (uint16_t)kPORT_OpenDrainDisable,
                                         /* Low drive strength is configured */
                                         (uint16_t)kPORT_LowDriveStrength,
                                         /* Normal drive strength is configured */
                                         (uint16_t)kPORT_NormalDriveStrength,
                                         /* Pin is configured as ADC0_B12 */
                                         (uint16_t)kPORT_PinDisabledOrAnalog,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         (uint16_t)kPORT_UnlockRegister};
    /* PORTB2 (pin 48) is configured as ADC0_B12 */
    PORT_SetPinConfig(BOARD_UNINITEPAPERPINS_SCKSI_IO1_PORT, BOARD_UNINITEPAPERPINS_SCKSI_IO1_PIN, &SCKSI_IO1);

    const port_pin_config_t SO_IO1 = {/* Internal pull-up/down resistor is disabled */
                                      (uint16_t)kPORT_PullDisable,
                                      /* Low internal pull resistor value is selected. */
                                      (uint16_t)kPORT_LowPullResistor,
                                      /* Fast slew rate is configured */
                                      (uint16_t)kPORT_FastSlewRate,
                                      /* Passive input filter is disabled */
                                      (uint16_t)kPORT_PassiveFilterDisable,
                                      /* Open drain output is disabled */
                                      (uint16_t)kPORT_OpenDrainDisable,
                                      /* Low drive strength is configured */
                                      (uint16_t)kPORT_LowDriveStrength,
                                      /* Normal drive strength is configured */
                                      (uint16_t)kPORT_NormalDriveStrength,
                                      /* Pin is configured as ADC0_B13 */
                                      (uint16_t)kPORT_PinDisabledOrAnalog,
                                      /* Pin Control Register fields [15:0] are not locked */
                                      (uint16_t)kPORT_UnlockRegister};
    /* PORTB3 (pin 1) is configured as ADC0_B13 */
    PORT_SetPinConfig(BOARD_UNINITEPAPERPINS_SO_IO1_PORT, BOARD_UNINITEPAPERPINS_SO_IO1_PIN, &SO_IO1);

    const port_pin_config_t portb4_pin2_config = {/* Internal pull-up/down resistor is disabled */
                                                  (uint16_t)kPORT_PullDisable,
                                                  /* Low internal pull resistor value is selected. */
                                                  (uint16_t)kPORT_LowPullResistor,
                                                  /* Fast slew rate is configured */
                                                  (uint16_t)kPORT_FastSlewRate,
                                                  /* Passive input filter is disabled */
                                                  (uint16_t)kPORT_PassiveFilterDisable,
                                                  /* Open drain output is disabled */
                                                  (uint16_t)kPORT_OpenDrainDisable,
                                                  /* Low drive strength is configured */
                                                  (uint16_t)kPORT_LowDriveStrength,
                                                  /* Normal drive strength is configured */
                                                  (uint16_t)kPORT_NormalDriveStrength,
                                                  /* Pin is disabled */
                                                  (uint16_t)kPORT_PinDisabledOrAnalog,
                                                  /* Pin Control Register fields [15:0] are not locked */
                                                  (uint16_t)kPORT_UnlockRegister};
    /* PORTB4 (pin 2) is disabled */
    PORT_SetPinConfig(PORTB, 4U, &portb4_pin2_config);

    const port_pin_config_t portb5_pin3_config = {/* Internal pull-up/down resistor is disabled */
                                                  (uint16_t)kPORT_PullDisable,
                                                  /* Low internal pull resistor value is selected. */
                                                  (uint16_t)kPORT_LowPullResistor,
                                                  /* Fast slew rate is configured */
                                                  (uint16_t)kPORT_FastSlewRate,
                                                  /* Passive input filter is disabled */
                                                  (uint16_t)kPORT_PassiveFilterDisable,
                                                  /* Open drain output is disabled */
                                                  (uint16_t)kPORT_OpenDrainDisable,
                                                  /* Low drive strength is configured */
                                                  (uint16_t)kPORT_LowDriveStrength,
                                                  /* Normal drive strength is configured */
                                                  (uint16_t)kPORT_NormalDriveStrength,
                                                  /* Pin is disabled */
                                                  (uint16_t)kPORT_PinDisabledOrAnalog,
                                                  /* Pin Control Register fields [15:0] are not locked */
                                                  (uint16_t)kPORT_UnlockRegister};
    /* PORTB5 (pin 3) is disabled */
    PORT_SetPinConfig(PORTB, 5U, &portb5_pin3_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
